# HasOverriddenAppearance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..HasOverriddenAppearance Property
MaterialNode Class See Also
---
Identifies if the default rendering appearance the material has is being overridden.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool HasOverriddenAppearance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasOverriddenAppearance As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasOverriddenAppearance {
	bool get ();
}
```

# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace